Repository: harvy4002/ons-ssdc-srm-collection
Catalog: srm-rh-ui/rh_ui/translations/*/LC_MESSAGES/messages.po
Languages: cy

source: Cookies
cy: Cwcis

source: To collect information about how you use this website, we use%(open_cookies_link)s cookies.%(close_link)s</br> This information helps us improve our services and make sure that the website works as well as possible.
cy: Er mwyn casglu gwybodaeth am sut rydych chi'n defnyddio'r wefan hon, rydym yn defnyddio%(open_cookies_link)s cwcis.%(close_link)s</br>Mae'r wybodaeth hon yn ein helpu i wella ein gwasanaethau a gwneud yn siŵr bod y wefan yn gweithio gystal â phosibl.

source: You can %(open_cookies_link)s change your cookie preferences%(close_link)s at any time.
cy: Gallwch chi %(open_cookies_link)s newid eich dewisiadau o ran cwcis %(close_link)s ar unrhyw adeg.

source: The following links open in a new tab
cy: Mae’r dolenni canlynol yn agor mewn tab newydd

source: About ONS studies
cy: Ynglŷn ag astudiaethau SYG

source: https://www.ons.gov.uk/surveys/informationforhouseholdsandindividuals
cy: https://cy.ons.gov.uk/surveys/informationforhouseholdsandindividuals

source: Accessibility statement
cy: Datganiad hygyrchedd

source: https://www.ons.gov.uk/help/accessibility
cy: https://cy.ons.gov.uk/help/accessibility

source: Contact us
cy: Cysylltu â ni

source: https://www.ons.gov.uk/aboutus/contactus/surveyenquiries
cy: https://cy.ons.gov.uk/aboutus/contactus/surveyenquiries

source: Privacy and data protection
cy: Preifatrwydd a diogelu data

source: Crown copyright and database rights 2020 OS 100019153.
cy: Hawlfraint y Goron a hawliau cronfa ddata 2020 OS 100019153.

source: https://www.ons.gov.uk/
cy: https://cy.ons.gov.uk/

source: ONS Surveys
cy: Arolygon SYG

source: Start study - ONS Surveys
cy: Dechrau'r astudiaeth - Arolygon SYG

source: Error: Start study - ONS Surveys
cy: Gwall: Dechrau'r astudiaeth - Arolygon SYG

source: Enter an access code
cy: Rhowch god mynediad

source: Enter a 16-character access code
cy: Rhowch god mynediad 16 nod

source: Access code not recognised. Enter the code again.
cy: Nid yw'r cod mynediad yn cael ei gydnabod. Rhowch y cod eto.

source: Start study
cy: Dechrau'r astudiaeth

source: Enter your 16-character access code
cy: Rhowch eich cod mynediad sy'n cynnwys 16 o nodau

source: Keep this code safe. You will need to enter it every time you access your study
cy: Cadwch y cod hwn yn ddiogel. Bydd angen i chi roi eich cod bob tro y byddwch chi'n mynd at eich astudiaeth

source: Your personal information is protected by law and will be kept confidential.
cy: Mae eich gwybodaeth bersonol wedi'i diogelu gan y gyfraith a chaiff ei chadw'n gyfrinachol.

source: Access study
cy: Agor yr astudiaeth

source: Where to find your access code
cy: Ble i ddod o hyd i'ch cod mynediad

source: Your access code can be found in the invitation letter or email you received. Your 16-character access code will be a combination of letters and numbers.
cy: Gellir dod o hyd i'ch cod mynediad yn y llythyr neu'r e-bost gwahoddiad a gawsoch. Bydd eich cod mynediad 16 nod yn gyfuniad o lythrennau a rhifau.

source: Telephone: +44 0808 196 1270<br>9am to 4:30pm Monday to Thursday<br>9am to 3pm Friday
cy: Ffôn: +44 0808 196 1270<br>9am i 4:30pm o ddydd Llun i ddydd Iau<br>9am i 3pm ar ddydd Gwener

source: Minicom (for the deaf and hearing impaired): 18001 +44 800 085 7376
cy: Minicom (ar gyfer pobl fyddar neu drwm eu clyw): 18001 +44 800 085 7376

source: Email:
cy: E-bost:

source: Who can I contact for further information?
cy: Â phwy y gallaf gysylltu i gael rhagor o wybodaeth?

source: Page not found
cy: Heb ddod o hyd i'r dudalen

source: If you entered a web address, check it is correct.
cy: Os gwnaethoch chi roi cyfeiriad gwe, gwnewch yn siŵr ei fod yn gywir.

source: If you pasted the web address, check you copied the whole address.
cy: Os gwnaethoch chi ludo'r cyfeiriad gwe, gwnewch yn siŵr eich bod wedi copïo'r cyfeiriad cyfan.

source: If the web address is correct or you selected a link or button, %(open)scontact us%(close)s for more help.
cy: Os yw'r cyfeiriad gwe yn gywir neu os gwnaethoch chi ddewis dolen neu fotwm, %(open)scysylltwch â ni%(close)s am fwy o gymorth.

source: Sorry, something went wrong
cy: Mae’n ddrwg gennym, aeth rhywbeth o’i le

source: We are experiencing some technical problems.
cy: Rydym yn profi rhai problemau technegol

source: Please try again later, or %(open)scontact us%(close)s if the problem continues.
cy: Ceisiwch eto nes ymlaen, neu %(open)scysylltwch â ni%(close)s os bydd y broblem yn parhau.

source: Cookies on start.surveys.ons.gov.uk
cy: Cwcis ar start.surveys.ons.gov.uk

source: Back
cy: Yn ol

source: Your cookie settings have been saved
cy: Mae eich gosodiadau cwcis wedi’u cadw

source: Some parts of start.surveys.ons.gov.uk may use additional cookies and will have their own cookie policy and banner.
cy: Gall rhai rhannau o start.surveys.ons.gov.uk ddefnyddio cwcis ychwanegol a bydd ganddynt eu polisi cwcis a’u baner eu hunain.

source: Return to previous page
cy: Dychwelyd i’r dudalen flaenorol

source: Cookies are small files saved on your device when you visit a website.
cy: Ffeiliau bach a gaiff eu cadw ar eich dyfais pan fyddwch chi'n mynd ar wefan yw cwcis.

source: We use cookies to store information about how you use this service, such as the pages you visit.
cy: Rydyn ni'n defnyddio cwcis i storio gwybodaeth am y ffordd rydych chi'n defnyddio'r gwasanaeth hwn, fel y tudalennau y byddwch chi'n mynd iddynt.

source: Cookie settings
cy: Gosodiadau cwcis

source: We use JavaScript to set our cookies. Javascript is not running on your browser so you cannot change your settings.
cy: Rydym yn defnyddio JavaScript i osod ein cwcis. Nid yw JavaScript yn rhedeg ar eich porwr felly ni allwch newid eich gosodiadau.

source: You can try:
cy: Gallwch geisio:

source: turning on JavaScript in your browser
cy: troi JavaScript ymlaen yn eich porwr

source: reloading the page in case there was a temporary fault with JavaScript
cy: ail-lwytho’r dudalen rhag ofn bod nam dros dro gyda JavaScript

source: We use three types of cookie. You can choose which cookies you're happy for us to use.
cy: Rydym yn defnyddio tri math o gwci. Gallwch ddewis pa gwcis rydych yn fodlon i ni eu defnyddio.

source: Cookies that measure website use
cy: Cwcis sy'n mesur defnydd o'r wefan

source: We use Google Analytics to measure how you use the website so we can improve it based on user needs. Google Analytics sets cookies that store anonymised information about:
cy: Rydym yn defnyddio Google Analytics i fesur y ffordd rydych yn defnyddio'r wefan er mwyn i ni allu ei gwella ar sail anghenion defnyddwyr. Mae Google Analytics yn gosod cwcis sy'n storio gwybodaeth wedi'i hanonymeiddio mewn perthynas â'r canlynol:

source: how you got to the site
cy: sut y gwnaethoch gyrraedd y wefan

source: the pages you visit on ons.gov.uk and how long you spend on each page
cy: y tudalennau y byddwch yn mynd iddynt ar cy.ons.gov.uk a faint o amser y byddwch yn ei dreulio ar bob tudalen

source: what you click on while you're visiting the site
cy: yr hyn y byddwch yn clicio arno tra byddwch ar y wefan

source: Learn more about these Google Analytics cookies
cy: Dysgwch fwy am y cwcis Google Analytics hyn

source: Name
cy: Enw

source: Purpose
cy: Diben

source: Expires
cy: Daw i ben

source: Used to distinguish users.
cy: Defnyddir i wahaniaethu rhwng defnyddwyr.

source: 2 years
cy: 2 flynedd

source: Used to persist session state.
cy: Defnyddir i gadw cyflwr y sesiwn.

source: We do not allow Google to use or share the data about how you use this site.
cy: Nid ydym yn caniatáu i Google ddefnyddio na rhannu'r data am y ffordd rydych yn defnyddio'r wefan hon.

source: Do you want to allow usage tracking?
cy: A hoffech ganiatáu tracio defnydd?

source: On
cy: Ymlaen

source: Off
cy: I ffwrdd

source: This selection will expire after two years.
cy: Bydd y dewis hwn yn dod i ben ar ôl dwy flynedd.

source: Cookies that help with our communications
cy: Cwcis sy'n ein helpu i gyfathrebu

source: Some of our pages may contain content from other sites which may set their own cookies. These sites are sometimes called “third party” services. This tells us how many people see the content and whether it’s useful.
cy: Gall rhai o'n tudalennau gynnwys eitemau o wefannau eraill a all osod eu cwcis eu hunain. Caiff y gwefannau hyn eu galw'n wasanaethau “trydydd parti” weithiau. Mae hyn yn dweud wrthym faint o bobl sy'n gweld y cynnwys a ph'un a yw'n ddefnyddiol.

source: In addition, if you share a link to a page, the service you share it on may set a cookie. We have no control over cookies set on other websites – you can turn them off, but not through us.
cy: Hefyd, os byddwch chi'n rhannu dolen i dudalen, mae'n bosibl y bydd y gwasanaeth y byddwch yn ei rhannu arno yn gosod cwci. Nid oes gennym unrhyw reolaeth dros gwcis a gaiff eu gosod ar wefannau eraill – gallwch eu diffodd, ond nid drwyddom ni.

source: Cookies that remember your settings
cy: Cwcis sy'n cofio eich gosodiadau

source: These cookies personalise your experience of using the site, by doing things like remembering your preferences and the choices you make.
cy: Mae'r cwcis hyn yn personoli eich profiad wrth ddefnyddio'r wefan, drwy wneud pethau fel cofio eich eich gosodiadau a'ch dewisiadau.

source: Strictly necessary cookies
cy: Cwcis cwbl angenrheidiol

source: These essential cookies do things like:
cy: Mae'r cwcis hanfodol hyn yn gwneud pethau fel:

source: remember the notifications you've seen so we do not show you them again
cy: cofio'r hysbysiadau rydych chi wedi'u gweld fel nad ydym yn eu dangos i chi eto

source: remember your progress through a form (for example, online business surveys)
cy: cofio ble rydych chi arni ar ffurflen (er enghraifft, arolygon busnes ar-lein)

source: They always need to be on.
cy: Mae angen i'r rhain fod ymlaen bob amser.

source: Your progress
cy: Ble rydych chi arni

source: We’ll set a cookie to remember your progress while logged in. These cookies do not store your personal data.
cy: Byddwn yn gosod cwci er mwyn cofio ble rydych chi arni tra byddwch chi wedi mewngofnodi. Nid yw'r cwcis hyn yn storio eich data personol.

source: To check that your browser can support cookies
cy: Cadarnhau y gall eich porwr gynnal cwcis

source: When a user closes the browser or when their cookie cache is cleared
cy: Pan fydd defnyddiwr yn cau'r porwr neu pan gaiff y storfa cwcis ei chlirio

source: To store your preferred language so that certain content can be displayed in your own language
cy: Storio eich dewis iaith fel bod modd dangos cynnwys penodol yn yr iaith honno

source: To keep your session active when using your account to access portfolio and messages
cy: Cadw eich sesiwn yn weithredol pan fyddwch chi'n defnyddio eich cyfrif i agor portffolio a negeseuon

source: To store the universally unique identifier created for your account
cy: Storio'r dynodydd unigryw cyffredinol a grëwyd ar gyfer eich cyfrif

source: To store the timestamp of the last request so that the session expiry warning message can be displayed
cy: Storio stamp amser y cais diwethaf fel bod modd dangos neges yn rhybuddio bod y sesiwn ar fin dod i ben

source: To keep you signed in when completing a survey
cy: Sicrhau eich bod yn parhau i fod wedi'ch mewngofnodi wrth gwblhau arolwg

source: When a user logs out or closes the browser. Or when their cookie cache is cleared
cy: Pan fydd defnyddiwr yn allgofnodi neu'n cau'r porwr. Neu pan gaiff y storfa cwcis ei chlirio

source: To store the flash object identifier for the most recent action you have performed
cy: Storio'r dynodydd gwrthrych fflach ar gyfer y weithred ddiweddaraf a gwblhawyd gennych

source: Cookie message
cy: Neges am gwcis

source: You may see a banner when you visit start.surveys.ons.gov.uk inviting you to accept cookies or review your settings. We’ll set cookies so that your computer knows you’ve seen it and not to show it again and store your settings.
cy: Mae'n bosibl y gwelwch faner pan fyddwch chi'n mynd i start.surveys.ons.gov.uk yn gofyn i chi dderbyn cwcis neu adolygu eich gosodiadau. Byddwn ni'n gosod cwcis fel bod eich cyfrifiadur yn gwybod eich bod wedi'i gweld ac yn peidio â'i dangos eto, ac i storio eich gosodiadau.

source: Lets us know that you’ve seen our cookie message
cy: Mae'n rhoi gwybod i ni eich bod wedi gweld ein neges am gwcis

source: 1 year
cy: Blwyddyn

source: Saves your cookie consent settings
cy: Mae'n cadw eich gosodiadau caniatâd cwcis

source: Learn more about these essential cookies
cy: Rhagor o wybodaeth am y cwcis hanfodol hyn

source: Save changes
cy: Cadw newidiadau

source: We will keep your information secure and confidential. This means that we will:
cy: Byddwn ni'n cadw eich gwybodaeth yn ddiogel ac yn gyfrinachol. Mae hyn yn golygu y byddwn ni'n:

source: recognise that you are sharing personal information with us and treat it as confidential, as directed by the<a href="https://code.statisticsauthority.gov.uk/" target="_blank"> Code of Practice for Statistics</a>
cy: cydnabod eich bod yn rhannu gwybodaeth bersonol â ni a'i thrin yn gyfrinachol, yn unol â'r <a href="https://code.statisticsauthority.gov.uk/" target="_blank">Cod Ymarfer ar gyfer Ystadegau</a>

source: only use your information for statistical purposes, or to help us run our surveys
cy: defnyddio eich gwybodaeth at ddibenion ystadegol yn unig, neu i'n helpu i gynnal ein harolygon

source: not publish anything that identifies an individual, household or business
cy: sicrhau na chaiff unrhyw beth ei gyhoeddi sy'n datgelu pwy yw unigolyn, cartref neu fusnes

source: only hold your information for as long as it is being used for producing statistics
cy: ond yn cadw eich gwybodaeth cyhyd ag y bydd yn cael ei defnyddio i gynhyrchu ystadegau

source: provide survey information to <a href="https://www.ons.gov.uk/aboutus/whatwedo/statistics/requestingstatistics/accesstounpublishedonsresearchdatabygovernmentorganisationsforstatisticalresearch" target="_blank"> other government departments, approved organisations</a> and <a href="https://www.ons.gov.uk/aboutus/whatwedo/statistics/requestingstatistics/approvedresearcherscheme" target="_blank"> approved researchers</a> for statistical purposes only, subject to the same standards of protection we apply (and according to the provisions of the Data Protection Legislation, the Statistics and Registration Service Act 2007 and the Code of Practice for Statistics
cy: darparu gwybodaeth arolwg i <a href="https://cy.ons.gov.uk/aboutus/whatwedo/statistics/requestingstatistics/accesstounpublishedonsresearchdatabygovernmentorganisationsforstatisticalresearch" target="_blank">adrannau eraill y Llywodraeth, sefydliadau cymeradwy</a> ac <a href="https://cy.ons.gov.uk/aboutus/whatwedo/statistics/requestingstatistics/approvedresearcherscheme" target="_blank">ymchwilwyr cymeradwys</a> at ddibenion ystadegol yn unig, gan gydymffurfio â'r un safonau diogelwch rydym yn eu dilyn (ac yn unol â darpariaethau Deddfwriaeth Diogelu Data, y Ddeddf Ystadegau a'r Gwasanaeth Cofrestru 2007 a'r Cod Ymarfer ar gyfer Ystadegau)

source: ensure our staff are aware of their obligations to protect your confidential information
cy: sicrhau bod ein staff yn ymwybodol o'u rhwymedigaethau i ddiogelu eich gwybodaeth gyfrinachol

source: maintain the security of our systems and our buildings
cy: sicrhau bod ein systemau a'n hadeiladau yn ddiogel

source: Access to information
cy: Mynediad at wybodaeth

source: We employ third-party providers to assist us in survey data collection. These third parties work under our instruction, and are strictly used as technical service providers in a capacity as a data processor. We retain your data and control how this is used. The third parties we work with are:
cy: Rydyn ni'n cyflogi darparwyr trydydd parti i'n helpu i gasglu data arolygon. Mae'r trydydd partïon hyn yn gweithio yn unol â'n cyfarwyddyd ni, ac yn cael eu defnyddio'n llwyr fel darparwyr gwasanaethau technegol fel prosesydd data. Rydyn ni'n cadw eich data ac yn rheoli sut y cânt eu defnyddio. Y trydydd partïon rydyn ni'n gweithio gyda nhw yw:

source: Further information
cy: Rhagor o wybodaeth

source: If you have a question about how we process your data or want to find out more about your rights under data protection legislation, see our <a href="https://www.ons.gov.uk/aboutus/transparencyandgovernance/dataprotection" target="_blank">protection page</a>.
cy: Os bydd gennych chi gwestiwn am y ffordd rydyn ni'n prosesu eich data personol, neu os byddwch chi am ddysgu mwy am eich hawliau o dan ddeddfwriaeth diogelu data, gweler ein <a href="https://cy.ons.gov.uk/aboutus/transparencyandgovernance/dataprotection" target="_blank">tudalen diogelu data.</a>

source: There is a problem with this page
cy: Mae problem gyda'r dudalen hon

source: Error - ONS Surveys
cy: Gwall - Arolygon SYG

source: This access code has already been used
cy: Mae'r cod mynediad hwn eisoes wedi cael ei ddefnyddio

source: Someone has already submitted a response using this access code.
cy: Mae rhywun eisoes wedi cyflwyno ymateb gan ddefnyddio’r cod mynediad hwn.

source: This questionnaire has now closed
cy: Mae'r holiadur hwn wedi cau erbyn hyn
